# ArcLengthDimensionNoReferencesOnArc Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ArcLengthDimensionNoReferencesOnArc Property
BuiltInFailures..::..DimensionFailures Class See Also
---
None of the segment references of this Arc Length Dimension intersects the bounded arc of the arc reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArcLengthDimensionNoReferencesOnArc { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArcLengthDimensionNoReferencesOnArc As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArcLengthDimensionNoReferencesOnArc {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace